# main.py

# Імпорт класу TV з модуля tv.
from tv import TV

# Імпорт класу SmartTV з модуля smart_tv.
from smart_tv import SmartTV

# Основна функція програми.
def main():
    # Створення екземпляра базового телевізора (TV) з параметрами "BasicBrand" та 43 дюйми.
    basic_tv = TV("BasicBrand", 43)
    # Увімкнення базового телевізора.
    basic_tv.turn_on()
    # Виведення інформації про базовий телевізор.
    basic_tv.show_info()
    # Вимкнення базового телевізора.
    basic_tv.turn_off()

    # Вивід порожнього рядка для розділення виведених результатів.
    print("\n")

    # Створення екземпляра смарт-телевізора (SmartTV) з параметрами "SmartBrand", 55 дюймів і "Digital".
    smart_tv = SmartTV("SmartBrand", 55, "Digital")
    # Увімкнення смарт-телевізора.
    smart_tv.turn_on()
    # Виведення інформації про смарт-телевізор.
    smart_tv.show_info()
    # Вимкнення смарт-телевізора.

if __name__ == "__main__":
    # Виклик основної функції, якщо сценарій виконується безпосередньо (не імпортується як модуль).
    main()
